article/BuildYourOwnLisp.org
* 简介(Introduction)
** 关于

在这本中，你将学会C语言和如何构建自己的编程语言，一个极小Lisp，1000行以下的代码
量。我们将使用一个库来完成最初工作，所以我在代码量上撒了点谎，但其余的代码都是原
创，最终你将会创建一个强大小巧的Lisp。

这本书是受其它从头构建自己编程语言教程的启发。我编写这本书表明，这种有趣且创建性
项目是学习一门编程语言极好的方法，不局限于抽象高级语言或老练的程序员。

许多人想学习C，但不知从何开始。现在不需借口。如果你遵循这本书，我可以保证，最坏
的情况，你将得到一个非常酷的新编程语言，同时也非常有希望成为一个有经历的C程序员。

** 适合谁

这本书适合任何想学习C或想知道如何构建他们自己编程语言的人，但不适合作为编程语言
入门书箱。任何有一点编程经历的人，在任何语言上，应该在里面找到一些新奇有趣的东西。

我试图让本书对初学者尽量友好。我非常欢迎初学者因为他们有非常多的发现。初学者也可
能发现本书具有挑战性。我们将覆盖一些新概念，基本上同时学习两门新编程语言。

如果你寻求帮助，你可能会发现人们对你没有耐心。你可能会发现，相比帮助，他们会花费
更多的时间来表达他们对这个主题有多了解。有经历的程序员可能会告诉你你错了。他们语
气的潜台词可能是你现在应该停止，不要给世界带来糟糕的代码。

经过一些像这样的交流之后，你可能会确定自己不是一个程序员，或不是真正喜欢编程，或
只是暂时没有明白。你可能认为你曾经喜欢在构建自己编程语言上的想法，但是现在你觉得
这些太抽象，你不再在乎。你现在关心其它的爱好，任何有趣的，快乐的或感兴趣的看法可
能已经变成成了障碍。

对于这些我只能道歉。程序员可以是心怀敌意的，大男子主义的，傲慢的，好斗的。不需要
为这些寻找理由。知道我是站在你这边。起初没有人明白。每个人都很努力，怀疑自己的能
力。请不要放弃或让快乐从创性的经历中吸走。为你的创造感到骄傲，不管是什么。人们比
如我不希望你放弃编程。我们想听到你的声音和你所说的话。

** 为何学C

C是这个世界上最流行最具影响力的程序语言之一。它是在Linux上开发的首选语言，已经在
OSX和MS上很普通。它也在微机上使用。你的冰箱或汽车上也可能在运行它。在现代软件开
发中，可能避开C的使用，但历史证明，任何一个想成为职业软件开发的人都应该学习C。

C与软件开发和职业无关，C是自由的。它在技术和自由上获取名望。它在计算机上体现了人
身自由理念。希望你能控制影响自己生活的技术。

** 如何学C

没有办法，C是一个困难的语言。它有许多生疏的概念。它没有试图帮助一个新手。在本书
中我没有覆盖语言的语法明细和如何编写循环和条件语句。

我将从另一方面展示如何用C构建一个现实世界中程序。这种方式对阅读者来言总是更困难，
但它更有希望地教会你一些传统方式不能教会的许多隐藏事情。我不能保证这本书能让你成
一个有信心的C使用者。我能承诺的是，那包裹在内容中的1000行代码，你将学会一些有价
值的事。

本书包含了16章节。如何完成本书取决于你。可能一个周末快速浏览一遍历或每晚慢慢地完
成1到2章。它不会花费很长的时间来完成，将希望你够更进一步的开发自己的语言。

** 为何构建一个Lisp

我们在本书中将要构建的语言是一个Lisp。在这个语言家庭中事实特征是它们所有的计算都
是由列表(list)表示的。这可能听起来可怕，事实上Lisp是非常简单，与众不同，强大的语言。

构建一个Lisp是一个非常好的项目，原因很多。它把你放进语言设计的世界，让你欣赏语言
整个过程，从语言一直到机器。它都会你函数式编程，新的计算方式。最终你获得的产品为
未来的想法和开发提供了模板，给你一个尝试新事物的开始。不能根本地理解编程和计算机
科学的创建和智慧，除非你探索语言本身。

我们将构造的Lisp类型是我为本书发明之一。我把它设计的非常极简，简单，清晰，我已经
非常喜欢它。我希望你将也喜欢它。在概念上，语法上，在实现中，这个Lisp与其它Lisp主
要分支有所不同。以至于我从Lisp程序员得到邮件告诉我说它不是Lisp因为它看起来不像。

我不是让这个Lisp的不同来迷惑初学者，我创建差异是因为差异是好的。

如果你想了解传统Lsip的语义和行为，如何使用它们编程，这本书可能不适合你。相反，本
书提供的是新鲜独特的概念，自我表达，创建力和乐趣。

** 自己的Lisp

遵循这本书最好的方式，如标题所言，编写自己的Lisp。你的Lisp应该适合你和你自己的哲
学。整本书我将会提供描述和观察，大量的代码。

自己输入每块示例代码，这称为The Hard Way。不是因为它在技术上困难，而是因为它需要
训练。通过The Hard Way完成事情你将明白输入代码背后的原理。

* 安装(Installation)
** 配置环境

在我们开始使用C编程之前，我们需要安装一些软件和设置环境。因为C是一个通
用语言且相当简单。我们至少需要安装两个主要基本软件：编辑器和编辑器。

** 编辑器

编辑器允许你使用一种适合编程的方式来编辑文本文件。

在Linux上我推荐使用gedit。如果你是一个Vim或Emacs用户，这些也可以使用。
请不要使用任何IDE。这个小项目不需要IDE，并且对于理解原理没有帮助。

在Mac上可以使用TextWrangler。请不要使用XCode。

在Windows上可以选择Notepad++。请不要使用Visual Studio。

** 编译器

编译器可以将C源码转换成电脑能运行的程序。编译器的安装过程取决于操作系
统。

在Linux上可以通过下载一些包来安装编译器。如果你运行Ubuntu或Debian，你
可以使用命令 *sudo apt-get install build-essential* 。如果你运行Fedora
或类似Linux变体，你可以使用命令 *su -c yum 'groupinstall
development-tools`* 。

在Mac上可你可以通过下载和安装最新版的XCode来安装编译器。

在Windows上你可以通过下载和安装MinGW来安装编译器。

*** 测试编译器

你可以使用如下命令来测试你的C编译器是否已安装：
*cc --version*

** Hello World

你的环境设置后，启动你的编辑器，输入如下代码。保存文件为hello\_world.c。

#+BEGIN_SRC c
#include <stdio.h>

int main(int argc, char **argv) {
    puts("Hello, world!");
    return 0;
}
#+END_SRC

我将尝试一步一步来解释这个程序。

第一次我们包含(include)头文件(header)。这个声明允许我们使用 *stdio.h*
中的函数。这个头文件包含了C的标准输入和输出函数库。后面我们在程序中看
到的函数 *puts* 就是这个库中的函数之一。

接下来我们声明的函数是 *main* 。这个函数的返回值类型是 *int* ,使
用 *int* 类型的 *argc* 和 *char *** 类型的 *argv* 作为参数。

在 *main* 函数内部， *puts* 函数被调用，它将Hello, world!输出到命令行
。 *puts* 函数是 *put string* 的简写。函数中的第二条语句是 *return
0;* 。 它告诉 *main* 函数结束并且返回0。当一个C程序返回0表明运行这个函
数没有错误。

** 编译

在运行这个程序之前我们需要编译它。它将产生一个实际可在电脑上执行的程序。
在命令行上我们可以输入如下命令：

#+BEGIN_SRC shell
cc -std=c99 -Wall hello_world.c -o hello_world
#+END_SRC

这个命令编译hello\_world.c中的代码，报告任何警告，并产生一个hello\_world
文件。我们使用 *-std=c99* 标志告诉编译器我们使用哪个标准C版本。这让编
译器确保我们的代码是标准的，这样不同的操作系统或编译器将可以使用我们的代
码。

如果编译成功，我们将看到目录中产生的hello\_world文件。输
入 *./hello\_world* 来运行这个程序。如果一切都正确我们最终会看
到 *Hello, world!* 消息出现。

** 错误

如果你的C程序有问题，在编译过程中可能会失败。这个问题原因范围可能从简
单的语法错误到难懂的复杂问题。

有时来自编译器的错误信息将变得有意义，如果你难以理解它可以尝试在网上搜
索相关信息。你应该先看看你是否能找出错误信息的意思和如何改正它。

有时多个编译错误可能源于相同处。

有时编译器能编译程序，但在运行时崩溃。这种情况下调试C程序非常困难。

如果你是一个初学者，调试崩溃的程序可以通过打印一些信息来定位出错的范围，
这是一个有效的调试技术。

可以使用 *gdb* 来调试你的C程序，使用它可能会很困难和难懂，但它非常强大，
能够给你非常有价值的信息以及生产错误信息和位置。

在Mac可以使用 *lldb** 来代替 *gdb* 完成同样的任务。

在Linux或Mac上 *valgrind* 可以用来检测内存溢出和其它的严重错误。
Valgrind能够节约你调试的时间。不需要太精通它，所以强烈推荐。

** 文档

这本书的实例中你可能会遇到不认识的函数，你可以查看标准库文档来了解它可以做
什么，以及如何使用它们。

* 基础(Basics)
