article/BuildYourOwnLisp.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 基础(Basics)</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 概述</h3>
<div class="outline-text-3" id="text-3-1">


<p>
这一章我们将快速浏览C的基本特征。
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 程序</h3>
<div class="outline-text-3" id="text-3-2">


<p>
C程序是由函数定义和结构体定义组成的。
</p>
<p>
因此一个源文件是函数和类型的列表。函数可以调用其它（或本身）函数，可以
使用任意已经定义或内置的数据类型。
</p>
<p>
可以调用其它库中的函数或使用库中的数据类型。
</p>
<p>
如前章所见，C程序的执行从 <b>main</b> 函数开始， <b>main</b> 内部调用其它更多的
函数来完成所需的行为。
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 变量</h3>
<div class="outline-text-3" id="text-3-3">


<p>
C中每个变量都有一个明确的类型。这些类型由我们定义或语言中内置。
</p>



<pre class="example">type variable[=value];
</pre>



<pre class="example">int count;
char ch = 'A';
</pre>


<p>
内置类型如下：
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">void</td><td class="left">空类型</td></tr>
<tr><td class="left">char</td><td class="left">字符</td></tr>
<tr><td class="left">int</td><td class="left">整型</td></tr>
<tr><td class="left">long</td><td class="left">长整型</td></tr>
<tr><td class="left">float</td><td class="left">单精度浮点类型</td></tr>
<tr><td class="left">double</td><td class="left">双精度浮点类型</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 函数声明</h3>
<div class="outline-text-3" id="text-3-4">


<p>
函数是操作变量的计算过程，可以改变程序的状态。它接收多个变量为输入，返
回单变量作为输出。
</p>



<pre class="example">//声明函数
return_type function_name(args...);

//定义函数
return_type function_name(args...)
{
      //function body...
}

//调用函数
function_name(...);
</pre>



<pre class="example">int add(int x, int y);

int add(int x, int y) {
      int rs = x + y;

      return rs;
}

int rs = add(10, 11);
</pre>


</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 结构体定义</h3>
<div class="outline-text-3" id="text-3-5">


<p>
结构体用于声明新类型。结构体将几个变量捆绑成一个包。
</p>
<p>
我们可以使用结构体来表示更复杂的数据类型。
</p>



<pre class="example">//定义结构体
struct name {
    type1 variable1;
    type2 variable2;
    //...
};

//使用结构体声明变量
struct name variable;
</pre>



<pre class="example">struct point {
    float x;
    float y;
};

struct point p;
p.x = 0.1;
p.y = 10.0;
</pre>


</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 指针</h3>
<div class="outline-text-3" id="text-3-6">


<p>
指针是一般类型的变种，在类型后面加上星号后缀。例如，定义整型指
针 <b>int *</b> 。我们已经看到过 <span style="text-decoration:underline;">char** argv</span> ， 这是一个指向指针的指针，
用于 <b>main</b> 函数的输入。
</p>
</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> 字符串</h3>
<div class="outline-text-3" id="text-3-7">


<p>
在C中字符串使用指针 <b>char*</b> 来表示。底层存储是的一个字符列表，最后一个
字符是空终止符(<i>null terminator</i>)。
</p>
<p>
字符串也可以使用双引号定义，将字符文本放置在双引号之内。如"Hello, world!"。
</p>
</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> 条件</h3>
<div class="outline-text-3" id="text-3-8">


<p>
条件语言是让程序在只能在满足某个条件时才执行。
</p>
<p>
为了在某个条件下执行代码我们使用 <b>if</b> 语句。 <b>else if</b> 和 <b>else</b> 都是
可选的。
</p>



<pre class="example">if (condition) {
    //statements...
} else if (condition) {
    //statements...
} else {
    //statements...
}
</pre>



<pre class="example">if (x &gt; 10 &amp;&amp; x &lt; 100) {
    puts("x is greater than 10 and less than 100!");
} else {
    puts("x is less than 11 or greater than 99!");
}
</pre>


</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> 循环</h3>
<div class="outline-text-3" id="text-3-9">


<p>
循环是允许代码能够重复执行直到某个条件变成假或计数器结束。
</p>
<p>
C中主要两种循环。一个是 <b>while</b> 循环， 这个循环重复执行代码块直到条件
变成假。
</p>



<pre class="example">while (condition) {
     //statements...
}
</pre>


<p>
第二种类型是 <b>for</b> 循环。
</p>



<pre class="example">for (initialiser; condition; incrementer) {
     //statements...
}
</pre>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 交互式提示符(An Interactive Prompt)</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 读取，求值，打印</h3>
<div class="outline-text-3" id="text-4-1">


<p>
当我们构建我们的编程语言时，我们需要某一些方法来与它交互。C可以修改代
码，重新编译后运行。更好的方法我们能动态地与语言进行交互。我们能够在许
多条件下测试它的条件都很迅速。为了达到这个目的，我们构建一个称为交互式
提示符(<i>interactive prompt</i>)的东西。
</p>
<p>
这个程序提示用户输入，并且反馈一些信息。使用它我们可以很容易的测试我们
的编程语言和了解它如何工作。这个系统叫REPL，是read-evaluate-print-loop
的缩写。这是一种常见与编程语言交互的方式，如Python。
</p>
<p>
在构建一个完整的REPL之前我们将从一些简单着手。我们将做一个系统，这个系
统提示用户输入，并且直接回显输入。之后我们可以将其扩展，使之能够解析用
户输入，计算它，就像它是一个真实的Lisp程序一样。
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 交互式提示符</h3>
<div class="outline-text-3" id="text-4-2">


<p>
第一步我们想编写一个循环，这个循环重复输出一个消息，然后等待用户输入。
为了获取用户输入我们可以使用函数 <b>fgets</b> ，它读取用户输入直到一个换行
符。我们需要一些地方来存储用户输入。我们可声明一个连续大小的输入缓冲区。
</p>
<p>
一旦我们存储了用户输入，我们可以将其打印，使用函数 <b>printf</b> 。
</p>



<pre class="example">#include &lt;stdio.h&gt;

/* Declare a buffer for user input of size 2048 */
static char input[2048];

int main(int argc, char** argv) {

  /* Print Version and Exit Information */
  puts("Lispy Version 0.0.0.0.1");
  puts("Press Ctrl+c to Exit\n");

  /* In a never ending loop */
  while (1) {

    /* Output our prompt */
    fputs("lispy&gt; ", stdout);

    /* Read a line of user input of maximum size 2048 */
    fgets(input, 2048, stdin);

    /* Echo input back to user */
    printf("No you're a %s", input);
  }

  return 0;
}
</pre>


<p>
用/* */包裹的信息是注释，它们被编译器忽略，用于方便人阅读程序了解其意
图。
</p>
<p>
<b>static char input[ 2048 ];</b> 代码行声明了一个包含了2048个字符的全局数
组。 这个预留的数据块我们可以在程序的任何位置访问它。这里我们用它来存
储从命令行的用户输入。关键字 <b>static</b> 使变量局限于这个文本。
</p>
<p>
我们编写了一个无限循环 <b>while(1)</b> 。在条件块中 <b>1</b> 表示永远为真。所以
在循环内部的命令将永远运行下去。
</p>
<p>
我们使用函数 <b>fputs</b> 来输入我们的提示符。它与 <b>puts</b> 有一个轻微的不同
是它不会添加换行符。我们使用 <b>fgets</b> 函数获取用户输入。两个函数都是需
要某个文件来写入或读取。为了这个我们提供了两个特殊的变量 <b>stdin</b>
和 <b>stdout</b> 。它们都在&lt;stdio.h&gt;中声明，代表了输入和输出。 <b>fgets</b> 函数
等待用户输入一行文本，然后它将文本存储到 <b>input</b> 缓冲区中，包含了换行
符。为了避免 <b>fgets</b> 读取过多的数据，我们提示了缓冲区的大小 <b>2048</b> 。
</p>
<p>
我们使用函数 <b>printf</b> 将消息回显给用户。这个函数提供了一种打印包含了多个
元素的消息的方法。它将参数与给定的字符串进行匹配。比如，我们看到 <b>%s</b>
，这意味着它将被接下来作为字符串的参数所取代。
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 编译</h3>
<div class="outline-text-3" id="text-4-3">


<p>
我们可以用如下命令来编译该代码：
</p>



<pre class="example">cc -std=c99 -Wall prompt.c -o prompt
</pre>


<p>
编译后我们可尝试运行它。你可以使用 <b>Ctrl+c</b> 来退出程序。如果一切都正确
你的程序应该如这样运行：
</p>



<pre class="example">Lispy Version 0.0.0.0.1
Press Ctrl+c to Exit

lispy&gt; hello
No You're a hello
lispy&gt; my name is Dan
No You're a my name is Dan
lispy&gt; Stop being so rude!
No You're a Stop being so rude!
lispy&gt;
</pre>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 编辑输入</h3>
<div class="outline-text-3" id="text-4-4">


<p>
如果你在Linux或Mac上工作，你将注意当你使用方向箭头r按键来编辑你的输入时产生
一些奇怪的行为。
</p>



<pre class="example">Lispy Version 0.0.0.0.3
Press Ctrl+c to Exit

lispy&gt; hel^[[D^[[C
</pre>


<p>
使用箭头按键会生产一些奇怪的字符 <b><sup>[[D</sup></b> 或 <b><sup>[[C</sup></b> ，而不是移动光标。我
们真正想要是能够在行上移动光标，删除和编辑我们的输入。
</p>
<p>
在Windows这些行为是默认的。在Linux和Mac需要库 <b>editline</b> 提供。在
Linux和Mac上我们需要用库函数调用来替换 <b>fputs</b> 和 <b>fgets</b> 调用。
</p>

</div>

<div id="outline-container-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> 使用Editline</h4>
<div class="outline-text-4" id="text-4-4-1">


<p>
<b>editline</b> 提供了两个函数供我们将来使用 <b>readline</b> 和 <b>add_history</b>
。 <b>readline</b> 函数用于从某提示读取输入，同时允许对输入进行编辑。
<b>add_history</b> 函数记录输入的历史以便我们能够通过上下方向键来重新获取之
前的输入。
</p>



<pre class="example">#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;

#include &lt;readline/readline.h&gt;
#include &lt;readline/history.h&gt;

int main(int argc, char** argv) {

  /* Print Version and Exit Information */
  puts("Lispy Version 0.0.0.0.1");
  puts("Press Ctrl+c to Exit\n");

  /* In a never ending loop */
  while (1) {

    /* Output our prompt and get input */
    char* input = readline("lispy&gt; ");

    /* Add input to history */
    add_history(input);

    /* Echo input back to user */    
    printf("No you're a %s\n", input);

    /* Free retrieved input */
    free(input);

  }

  return 0;
}
</pre>


<p>
我们包含了几个新头文件， <b>#include &lt;stdlib.h&gt;</b> 用于访问 <b>free</b> 函数。
<b>#include &lt;readline/readline.h&gt;</b> 和 <b>#include &lt;readline/history.h&gt;</b> 用
于访问 <b>readline</b> 和 <b>add_history</b> 函数。
</p>
<p>
不像 <b>fgets</b> ， <b>readline</b> 函数去掉了输入尾部的换行符，所以我们需要
在 <b>printf</b> 函数加上换行符。我们需要删除 <b>readline</b> 函数返回的input，
当 <b>readline</b> 函数被调用时，它分配了新内存。在不需要这个内存的时候通过
函数 <b>free</b> 释放这个内存。
</p>
</div>

</div>
