article/BuildYourOwnLisp.html

<div id="outline-container-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> 与Editline一起编译</h4>
<div class="outline-text-4" id="text-4-4-2">


<p>
如果按上次命令来编译可能会得到一个错误。这是因为你需要安装 <b>editline</b>
库。
</p>



<pre class="example">fatal error: readline/readline.h: No such file or directory #include &lt;readline/readline.h&gt;
</pre>


<p>
在Linux上，可以通过命令 <b>sudo apt-get install libedit-devel</b> 或 <b>su -c `yum install libedit-devel`</b>  来安装
editline库。
</p>
<p>
一旦你已经安装了editline库并尝试再次编译，你会等到另外一个不同的错误。
</p>



<pre class="example">undefined reference to `readline'
undefined reference to `add_history'
</pre>


<p>
这意味着你的程序没有链接到 <b>editline</b> 。 链接过程允许编译器直接
将 <b>editline</b> 嵌入到你的程序中。你可通过添加 <b>-ledit</b> 标志到你的编译命
令中来完成链接。
</p>



<pre class="example">CC -std=c99 -Wall prompt.c -ledit -o prompt
</pre>


</div>
</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> C预处理器</h3>
<div class="outline-text-3" id="text-4-5">


<p>
不在同的操作或编译器上都能编译和运行，这叫可移植性(<i>portability</i>)。在C
存在这个问题，并不总是有一个简单或正确的解决方案。
</p>
<p>
但是C提供了一个有用的机器，叫预处理器(<i>preprocessor</i>)。
</p>
<p>
预处理器是一个在编译器之前运行的程序。它有很多用途，而且我们已经实际地
在不知情的情况下使用了它。任何以#开头的行都是一个预处理命令。我们已经
使用它包含头文件(<i>include</i>)，使我们能够访问标准或其它库的函数。
</p>
<p>
预处理器另外一个用法就是判断操作系统的类型来编译不同的代码。
</p>
<p>
这正是我们要使用它的方式。如果我们在Windows上编译和运行代码，我们需要
准备伪造一些像 <b>readline</b> 和 <b>add<sub>history</sub></b> 的函数。否则我们包
含 <b>editline</b> 的头文件。
</p>
<p>
为了声明哪些代码编译器应该编译，我们用 <b>#ifndef</b> , <b>#else</b> , <b>endif</b>
预处理语句将它们包含。
</p>



<pre class="example">#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;

/* If we are compiling on Windows compile these functions */
#ifdef _WIN32
#include &lt;string.h&gt;

static char buffer[2048];

/* Fake readline function */
char* readline(char* prompt) {
  fputs(prompt, stdout);
  fgets(buffer, 2048, stdin);
  char* cpy = malloc(strlen(buffer)+1);
  strcpy(cpy, buffer);
  cpy[strlen(cpy)-1] = '\0';
  return cpy;
}

/* Fake add_history function */
void add_history(char* unused) {}

/* Otherwise include the editline headers */
#else
#include &lt;readline/readline.h&gt;
#include &lt;readline/history.h&gt;
#endif

int main(int argc, char** argv) {

  puts("Lispy Version 0.0.0.0.1");
  puts("Press Ctrl+c to Exit\n");

  while (1) {

    /* Now in either case readline will be correctly defined */
    char* input = readline("lispy&gt; ");
    add_history(input);

    printf("No you're a %s\n", input);
    free(input);

  }

  return 0;
}
</pre>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 语言(Languages)</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 编程语言是什么?</h3>
<div class="outline-text-3" id="text-5-1">


<p>
编程语言与现实语言非常类似。背后有结构，规则。当我们阅读和书写自然语言，
我们在不知不觉中学习那些规则，编程语言也是如此。我们利用这些规则来理解
他人，产生自己的言语或代码。
</p>
<p>
1950年语言学家Noam Chomsky正规化了语言的一些重要观点。这些见解形成我们
理解语言的基础。最重要的观点之一就是自然语言是建立在递归和重复子结构之
上。
</p>
<p>
例如：
</p>


<pre class="example">The cat walked on the carpet.
</pre>


<p>
使用英语规则，名词cat能够使用两个用and分隔的名词替换。
</p>


<pre class="example">The cat and dog walked on the carpet.
</pre>


<p>
每个新名词又能依次被替换。我们可以与之前相同的规则，将cat替换成用and连
接的两个新名词。或者我们可以使用另一个不同规则，用形容词和名词来替换每
个名词。
</p>


<pre class="example">The cat and mouse and dog walked on the carpet.
</pre>



<pre class="example">The white cat and black dog walked on the carpet.
</pre>


<p>
这里仅仅只有两个例子，但英语有许多不同的规则来规定了哪些单词类型能够被改变，操作，和
替换。
</p>
<p>
我们注意这些行为在编程语言也存在，包括C。在C中， <b>if</b> 语句的主体是一组语句。
而每个语句可以是其它的 <b>if</b> 语句。那些重复结构和替换在语言的所有地方体
现出来。
</p>



<pre class="example">if (x &gt; 5) { return x; }
</pre>


<pre class="example">if (x &gt; 5) { if (x &gt; 10) { return x; } }
</pre>


<p>
Chomsky的这个观点的结果非常重要。它意味着虽然在一个特定的语言中可以说
或写无穷多个不同事情，但仍然有可能用有限的规则来处理和明白它们。这些规
则被称为语法(<i>grammar</i>)。
</p>
<p>
为了编写一门编程语言如Lisp我们将需要理解语法。为了读取用户输入我们需要
编写语法来描述输入。然后我们用语法来检测输入的有效性。我们也可以使用它
建议一个结构化的内部表示形式，能更容易地理解，计算和执行。
</p>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 解析组合式</h3>
<div class="outline-text-3" id="text-5-2">


<p>
<b>mpc</b> 是我编写的一个解析组合式库。这个库能允许我们构建理解和处理特定语
言的程序。称为解析器(<i>parser</i>)。
</p>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 编码语法</h3>
<div class="outline-text-3" id="text-5-3">


<p>
像语法的代码看起来像什么？让我们看一下 <b>mpc</b> ，尝试用它编写识别Shiba
Inu语言（更通俗的称法是Doge）的语法。这个语言我们定义如下：
</p><ul>
<li>形容词，如"wow", "many", "so", "such"
</li>
<li>名词，如"lisp", "language", "c", "book", "build"
</li>
<li>短语，形容词+名词
</li>
<li>Doge就是0或多个短语
</li>
</ul>


<p>
我们可以从尝试定义形容词和名词开始。我们创建两个新解析器，
用 <b>mpc_parser_t*</b> 来表示。我们把它们存储在两个变量 <b>Adjective</b>
和 <b>Noun</b> 中。
</p>



<pre class="example">/* Build a parser 'Adjective' to recognize descriptions */
mpc_parser_t* Adjective = mpc_or(4, 
  mpc_sym("wow"), mpc_sym("many"),
  mpc_sym("so"),  mpc_sym("such")
);

/* Build a parser 'Noun' to recognize things */
mpc_parser_t* Noun = mpc_or(5,
  mpc_sym("lisp"), mpc_sym("language"),
  mpc_sym("book"),mpc_sym("build"), 
  mpc_sym("c")
);
</pre>


<p>
为了定义 <b>Phrase</b> ，我们需要使用函数 <b>mpc_and</b> ，我们向它传
递 <b>Ajdective</b> 和 <b>Noun</b> 作为输入。这个函数还需要两个参
数 <b>mpcf_strfold</b> 和 <b>free</b> 。
</p>



<pre class="example">mpc_parser_t* Phrase = mpc_and(2, mpcf_strfold, 
  Adjective, Noun, free);
</pre>


<p>
为了定义Doge我们必须指定0或多个必需的解析器。我们需要使用函
数 <b>mpc_many</b> 。该函数需要指定变量 <b>mpcf_strfold</b> 。
</p>



<pre class="example">mpc_parser_t* Doge = mpc_many(mpcf_strfold, Phrase);
</pre>


<p>
我们的Doge解析器可以接收任意长度的输入。这意味着它的语言是不穷的。
</p>
<p>
如果我们使用更多 <b>mpc</b> 函数，我们可以慢慢构建解析器来解析出越来越复杂
的语言。 我们代码读起来像一个语法，但随着复杂度会变得越来越混乱。因此，
采取这样的方式并不总是一件容易的任务。
</p>
</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 自然语法</h3>
<div class="outline-text-3" id="text-5-4">


<p>
<b>mpc</b> 可以让我们像更自然的形式来编写语法。相比使用看起不像语法的C函数，
我们可以使用一个长字符串来指定所有事情。
</p>



<pre class="example">mpc_parser_t* Adjective = mpc_new("adjective");
mpc_parser_t* Noun      = mpc_new("noun");
mpc_parser_t* Phrase    = mpc_new("phrase");
mpc_parser_t* Doge      = mpc_new("doge");

mpca_lang(MPCA_LANG_DEFAULT,
  "                                           \
    adjective : \"wow\" | \"many\"            \
              |  \"so\" | \"such\";           \
    noun      : \"lisp\" | \"language\"       \
              | \"book\" | \"build\" | \"c\"; \
    phrase    : &lt;adjective&gt; &lt;noun&gt;;           \
    doge      : &lt;phrase&gt;*;                    \
  ",
  Adjective, Noun, Phrase, Doge);

/* Do some parsing here... */

mpc_cleanup(4, Adjective, Noun, Phrase, Doge);
</pre>


<p>
用于定义规则的特殊符号作用如下：
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">"ab"</td><td class="left">字符串ab是必需的</td></tr>
<tr><td class="left">'a'</td><td class="left">字符a是必需的</td></tr>
<tr><td class="left">'a' 'b'</td><td class="left">'a'先是必需的，然后'b'是必需的</td></tr>
<tr><td class="left">'a' &#124; 'b'</td><td class="left">'a'或'b'是必需的</td></tr>
<tr><td class="left">'a'*</td><td class="left">0个或多个'a'是必需的</td></tr>
<tr><td class="left">'a'+</td><td class="left">一个或多个'a'是必需的</td></tr>
<tr><td class="left">&lt;abba&gt;</td><td class="left">称为abba的规则是必需的</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 语法分析(Parsing)</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 波兰表示法</h3>
<div class="outline-text-3" id="text-6-1">


<p>
为了试用 <b>mpc</b> 我们将实现一个简单的语法，类似我们Lisp的一个数学子集。
它将波兰表示法(<i>Polish Notation</i>)，这种表示法用来表示操作符在操作数之
前的算术运算。
</p>
<p>
例如：
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">1+2+6</td><td class="left">+ 1 2 6</td></tr>
<tr><td class="left">6+(2*9)</td><td class="left">+ 6 (* 2 9)</td></tr>
<tr><td class="left">(10*2)/(4 + 2)</td><td class="left">/ (* 10 2) (+ 4 2)</td></tr>
</tbody>
</table>


<p>
我们需要制定出用来描述这种表示法的语法。
</p>
<p>
我们观察到在波兰表示法中，操作符总是表示式中的第一位，接下来是数字或者
其它在括号中的表达式。这意味我们可以说“一个程序是一个操作符后面跟着一
个或多个表达式，表达式既可以是一个数字，或者是在括号中的一个操作符跟着
一个或多个表达式”。
</p>
<p>
更正规：
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">程序</td><td class="left">输入开始，操作符，一个或多个表达式，输入结束</td></tr>
<tr><td class="left">表达式</td><td class="left">数字或(一个操作符，一个或多个表达式)</td></tr>
<tr><td class="left">操作符</td><td class="left">+， -，*，/</td></tr>
<tr><td class="left">数字</td><td class="left">可选的'-'，一个或多个0到9之间字符</td></tr>
</tbody>
</table>


</div>

</div>
