article/BuildYourOwnLisp.org
** 正则表达式

我应该能够使用我们已知的知识来对上面规则进行编码，但 *数字* 和 *程序*
可能会造成一些麻烦。它们包含了几个我们仍不知道如何表示的结构。我们不知
道如何表示输入的开始和结构，可选字符，或字符区间。

它们可以表示，但它们需要一个称为正则表达式(/Regular Expression/)的东西。
正则表达式是一种为一小段文本如单词或数字编写语法的方式。用正则表达式编
写语法不是由多个规则组合，而是它们能够给出精确和简洁的控制哪些能匹配哪
些不能匹配。这里有编写正则表达式的基础规则：
| .        | 任意一个字符                 |
| a        | 字符a                        |
| [abcdef] | 任意一个在集合abcdef中的字符 |
| [a-f]    | 任意一个在范围a到f之间的字符 |
| a?       | 字符a是可选的                |
| a*       | 0个或多个a字符               |
| a+       | 1个或多个a字符               |
| \^     | 输入的开始                   |
| $        | 输入的结束                   |

这些是我们现在需要的所有正则表达式规则。

在 *mpc* 语法中，我们将正则表达式放在两个/之间。使用上面的指南，我们的
数字规则可以用正则表达式/-?[0-9]+/的字符串来表达。

** 安装mpc

在我们编写语法之间首先要包含 *mpc* 头文件然后链接到 *mpc* 库。 我们下
载 *mpc.c* 和 *mpc.h* 。把它们放到与源文件的同一个目录下。

为了包含 *mpc* ，将 #include "mpc.h" 放到文件的顶部。 为了链接到 *mpc*
将 *mpc.c* 直到放到编译命令中。在Linux上，我们需要添加 *-lm* 标志来链
接到数学库。

在Linux和Mac上

#+BEGIN_SRC shell
cc -std=c99 -Wall parsing.c mpc.c -ledit -lm -o parsing
#+END_SRC

** 波兰表示法语法

对上面的规则进一步正规化。使用正则表达式，我们可以为波兰表示法编写出如
下的最终语法。

#+BEGIN_SRC C
/* Create Some Parsers */
mpc_parser_t* Number   = mpc_new("number");
mpc_parser_t* Operator = mpc_new("operator");
mpc_parser_t* Expr     = mpc_new("expr");
mpc_parser_t* Lispy    = mpc_new("lispy");

/* Define them with the following Language */
mpca_lang(MPC_LANG_DEFAULT,
  "                                                     \
    number   : /-?[0-9]+/ ;                             \
    operator : '+' | '-' | '*' | '/' ;                  \
    expr     : <number> | '(' <operator> <expr>+ ')' ;  \
    lispy    : /^/ <operator> <expr>+ /$/ ;             \
  ",
  Number, Operator, Expr, Lispy);
#+END_SRC

我们将让面的代码添加到第4章的交互式提示符代码中。把这个代码添加
在 *main* 函数中，放在打印Version和Exit信息之前。在 *main* 尾部需要添
加删除解析器的清理函数。

#+BEGIN_SRC C
/* Undefine and Delete our Parsers */
mpc_cleanup(4, Number, Operator, Expr, Lispy);
#+END_SRC

** 解析用户输入

我们为波兰表示法语言创建一个 *mpc* 解析器，我们需要将其作用用户输入上。
我们需要修改 *while* 循环。将 *printf* 打印代码替换成下面的 *mpc* 代码。

#+BEGIN_SRC C
/* Attempt to Parse the user Input */
mpc_result_t r;
if (mpc_parse("<stdin>", input, Lispy, &r)) {
  /* On Success Print the AST */
  mpc_ast_print(r.output);
  mpc_ast_delete(r.output);
} else {
  /* Otherwise Print the Error */
  mpc_err_print(r.error);
  mpc_err_delete(r.error);
}
#+END_SRC

这段代码调用了 *mpc\_parse* 函数，该函数使用 *Lispy* 解析器和 *input*
输入字符串。它将解析的结果复制到 *r* 中，如果成功返回1，否则返回0。

如果成功，一个内部结构体复制到 *r* 的 *output* 中。我们可以使
用 *mpc\_ast\_print* 来打印这个结构体，使用 *mpc\_ast\_delete* 来删除结构
体。

#+BEGIN_SRC C
Lispy Version 0.0.0.0.2
Press Ctrl+c to Exit

lispy> + 5 (* 2 2)
>
  regex
  operator|char:1:1 '+'
  expr|number|regex:1:3 '5'
  expr|>
    char:1:5 '('
    operator|char:1:6 '*'
    expr|number|regex:1:8 '2'
    expr|number|regex:1:10 '2'
    char:1:11 ')'
  regex
lispy> hello
<stdin>:1:1: error: expected whitespace, '+', '-', '*' or '/' at 'h'
lispy> / 1dog
<stdin>:1:4: error: expected one of '0123456789', whitespace, '-', one or more of one of '0123456789', '(' or end of input at 'd'
lispy>
#+END_SRC

* 计算求值(Evaluation)
** 树

现在我们能够读取输入，获取内部结构，但仍然不能对其求值。在这章中我们将
现在如何求值。

上一章我们看到打印来的内部结构体。它被称为抽象语法树(/Abstract Syntax
Tree/)，它表示了基于用户输入的结构体。树的每个叶子都是数和操作符（实现
被处理的数据）。树的分支就是用于产生树的这部分的规则（基于对树如何遍历和求
值的信息）。

在考虑如何做遍历之前，我们先看下定义在内部的结构体。在 *mpc.h* 找到结
构体 *mpc\_ast\_t* 的定义。

#+BEGIN_SRC C
typedef struct mpc_ast_t {
  char* tag;
  char* contents;
  mpc_state_t state;
  int children_num;
  struct mpc_ast_t** children;
} mpc_ast_t;
#+END_SRC

*tag* - 包含了一个规则列表的字符串，如expr|number|regex。该字段可以让
我们看到哪些解析规则可用于节点。

*contents* - 包含了节点的实际内容，如'*','('或'5'。分支中这个段是空，
叶子上操作符或数字。

*state* - 包含了节点的状态信息，如行列编号。

*children\_num* - 节点拥有孩子的个数。

*children* - 数组指针。

#+BEGIN_SRC C
/* Load AST from output */
mpc_ast_t* a = r.output;
printf("Tag: %s\n", a->tag);
printf("Contents: %s\n", a->contents);
printf("Number of children: %i\n", a->children_num);

/* Get First Child */
mpc_ast_t* c0 = a->children[0];
printf("First Child Tag: %s\n", c0->tag);
printf("First Child Contents: %s\n", c0->contents);
printf("First Child Number of children: %i\n",
  c0->children_num);
#+END_SRC

** 递归

这个树的结构体有点奇怪。它引用自身。树的每个孩子都是树，孩子的孩子同样
也是树。

明确的是如果我们想让一个函数工作于任何树，我们不同只能几个节点，我们必
须将其定义成为在任何深度的树都可以工作。

幸运地是我们能够做这点，通过结构体的重复性质，使用一种称为递归
(/recursion/)的技术。

递归函数作为其计算的一部分调用自身。

#+BEGIN_SRC C
int number_of_nodes(mpc_ast_t* t) {
  if (t->children_num == 0) { return 1; }
  if (t->children_num >= 1) {
    int total = 1;
    for (int i = 0; i < t->children_num; i++) {
      total = total + number_of_nodes(t->children[i]);
    }
    return total;
  }
}
#+END_SRC

** 求值

为了计算语法树我们将编写一个递归函数。在开始让我们看看从用户输入获取树
的结构体。
#+BEGIN_SRC shell
lispy> * 10 (+ 1 51)
>
  regex
  operator|char:1:1 '*'
  expr|number|regex:1:3 '10'
  expr|>
    char:1:6 '('
    operator|char:1:7 '+'
    expr|number|regex:1:9 '1'
    expr|number|regex:1:11 '51'
    char:1:13 ')'
  regex
#+END_SRC

如果节点被标记为 *number* ，则它没有孩子，我们可以仅仅将内容转换成整型。

如果节点被标记为 *expr* ，而非 *number* ，我们需要查看它的第二个孩子
（第一个孩子通常是'('）是什么操作符。然后我们将这个操作符应用于剩余
孩子的计算，除了最后一个孩子通常是')'。

当我们对树求值，就是对节点计数，我们需要累积结果。为了表示结果我们将使
用C类型长整型 *long* 。

为了检测节点的标签或得到节点的数字，我们需要使用 *tag* 和 *contents*
字段。这个字段是字符串类型，所以我们先学习几个字符串函数：
| atoi   | 将 char* 转换成long                                                             |
| strcmp | 比较两个 char*，如果相等返回0                                                   |
| strstr | 字符串查找，返回第二个字符串在第一个字符串中的位置。如果没有找到，返回0     |

我们可以使用 *strcmp* 来检测使用操作符，使用 *strstr* 来检测标签包含某
个子串。我们的递归求值函数看起来如下：
#+BEGIN_SRC C
long eval(mpc_ast_t* t) {
  
  /* If tagged as number return it directly. */ 
  if (strstr(t->tag, "number")) {
    return atoi(t->contents);
  }
  
  /* The operator is always second child. */
  char* op = t->children[1]->contents;
  
  /* We store the third child in `x` */
  long x = eval(t->children[2]);
  
  /* Iterate the remaining children and combining. */
  int i = 3;
  while (strstr(t->children[i]->tag, "expr")) {
    x = eval_op(x, op, eval(t->children[i]));
    i++;
  }
  
  return x;  
}
#+END_SRC

我们定义 *eval\_op* 函数如下。
#+BEGIN_SRC C
/* Use operator string to see which operation to perform */
long eval_op(long x, char* op, long y) {
  if (strcmp(op, "+") == 0) { return x + y; }
  if (strcmp(op, "-") == 0) { return x - y; }
  if (strcmp(op, "*") == 0) { return x * y; }
  if (strcmp(op, "/") == 0) { return x / y; }
  return 0;
}
#+END_SRC

