article/BuildYourOwnLisp.html

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 正则表达式</h3>
<div class="outline-text-3" id="text-6-2">


<p>
我应该能够使用我们已知的知识来对上面规则进行编码，但 <b>数字</b> 和 <b>程序</b>
可能会造成一些麻烦。它们包含了几个我们仍不知道如何表示的结构。我们不知
道如何表示输入的开始和结构，可选字符，或字符区间。
</p>
<p>
它们可以表示，但它们需要一个称为正则表达式(<i>Regular Expression</i>)的东西。
正则表达式是一种为一小段文本如单词或数字编写语法的方式。用正则表达式编
写语法不是由多个规则组合，而是它们能够给出精确和简洁的控制哪些能匹配哪
些不能匹配。这里有编写正则表达式的基础规则：
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">.</td><td class="left">任意一个字符</td></tr>
<tr><td class="left">a</td><td class="left">字符a</td></tr>
<tr><td class="left">[abcdef]</td><td class="left">任意一个在集合abcdef中的字符</td></tr>
<tr><td class="left">[a-f]</td><td class="left">任意一个在范围a到f之间的字符</td></tr>
<tr><td class="left">a?</td><td class="left">字符a是可选的</td></tr>
<tr><td class="left">a*</td><td class="left">0个或多个a字符</td></tr>
<tr><td class="left">a+</td><td class="left">1个或多个a字符</td></tr>
<tr><td class="left">^</td><td class="left">输入的开始</td></tr>
<tr><td class="left">$</td><td class="left">输入的结束</td></tr>
</tbody>
</table>


<p>
这些是我们现在需要的所有正则表达式规则。
</p>
<p>
在 <b>mpc</b> 语法中，我们将正则表达式放在两个/之间。使用上面的指南，我们的
数字规则可以用正则表达式/-?[0-9]+/的字符串来表达。
</p>
</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 安装mpc</h3>
<div class="outline-text-3" id="text-6-3">


<p>
在我们编写语法之间首先要包含 <b>mpc</b> 头文件然后链接到 <b>mpc</b> 库。 我们下
载 <b>mpc.c</b> 和 <b>mpc.h</b> 。把它们放到与源文件的同一个目录下。
</p>
<p>
为了包含 <b>mpc</b> ，将 #include "mpc.h" 放到文件的顶部。 为了链接到 <b>mpc</b>
将 <b>mpc.c</b> 直到放到编译命令中。在Linux上，我们需要添加 <b>-lm</b> 标志来链
接到数学库。
</p>
<p>
在Linux和Mac上
</p>



<pre class="example">cc -std=c99 -Wall parsing.c mpc.c -ledit -lm -o parsing
</pre>


</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 波兰表示法语法</h3>
<div class="outline-text-3" id="text-6-4">


<p>
对上面的规则进一步正规化。使用正则表达式，我们可以为波兰表示法编写出如
下的最终语法。
</p>



<pre class="example">/* Create Some Parsers */
mpc_parser_t* Number   = mpc_new("number");
mpc_parser_t* Operator = mpc_new("operator");
mpc_parser_t* Expr     = mpc_new("expr");
mpc_parser_t* Lispy    = mpc_new("lispy");

/* Define them with the following Language */
mpca_lang(MPC_LANG_DEFAULT,
  "                                                     \
    number   : /-?[0-9]+/ ;                             \
    operator : '+' | '-' | '*' | '/' ;                  \
    expr     : &lt;number&gt; | '(' &lt;operator&gt; &lt;expr&gt;+ ')' ;  \
    lispy    : /^/ &lt;operator&gt; &lt;expr&gt;+ /$/ ;             \
  ",
  Number, Operator, Expr, Lispy);
</pre>


<p>
我们将让面的代码添加到第4章的交互式提示符代码中。把这个代码添加
在 <b>main</b> 函数中，放在打印Version和Exit信息之前。在 <b>main</b> 尾部需要添
加删除解析器的清理函数。
</p>



<pre class="example">/* Undefine and Delete our Parsers */
mpc_cleanup(4, Number, Operator, Expr, Lispy);
</pre>


</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> 解析用户输入</h3>
<div class="outline-text-3" id="text-6-5">


<p>
我们为波兰表示法语言创建一个 <b>mpc</b> 解析器，我们需要将其作用用户输入上。
我们需要修改 <b>while</b> 循环。将 <b>printf</b> 打印代码替换成下面的 <b>mpc</b> 代码。
</p>



<pre class="example">/* Attempt to Parse the user Input */
mpc_result_t r;
if (mpc_parse("&lt;stdin&gt;", input, Lispy, &amp;r)) {
  /* On Success Print the AST */
  mpc_ast_print(r.output);
  mpc_ast_delete(r.output);
} else {
  /* Otherwise Print the Error */
  mpc_err_print(r.error);
  mpc_err_delete(r.error);
}
</pre>


<p>
这段代码调用了 <b>mpc_parse</b> 函数，该函数使用 <b>Lispy</b> 解析器和 <b>input</b>
输入字符串。它将解析的结果复制到 <b>r</b> 中，如果成功返回1，否则返回0。
</p>
<p>
如果成功，一个内部结构体复制到 <b>r</b> 的 <b>output</b> 中。我们可以使
用 <b>mpc_ast_print</b> 来打印这个结构体，使用 <b>mpc_ast_delete</b> 来删除结构
体。
</p>



<pre class="example">Lispy Version 0.0.0.0.2
Press Ctrl+c to Exit

lispy&gt; + 5 (* 2 2)
&gt;
  regex
  operator|char:1:1 '+'
  expr|number|regex:1:3 '5'
  expr|&gt;
    char:1:5 '('
    operator|char:1:6 '*'
    expr|number|regex:1:8 '2'
    expr|number|regex:1:10 '2'
    char:1:11 ')'
  regex
lispy&gt; hello
&lt;stdin&gt;:1:1: error: expected whitespace, '+', '-', '*' or '/' at 'h'
lispy&gt; / 1dog
&lt;stdin&gt;:1:4: error: expected one of '0123456789', whitespace, '-', one or more of one of '0123456789', '(' or end of input at 'd'
lispy&gt;
</pre>


</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 计算求值(Evaluation)</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 树</h3>
<div class="outline-text-3" id="text-7-1">


<p>
现在我们能够读取输入，获取内部结构，但仍然不能对其求值。在这章中我们将
现在如何求值。
</p>
<p>
上一章我们看到打印来的内部结构体。它被称为抽象语法树(<i>Abstract Syntax Tree</i>)，它表示了基于用户输入的结构体。树的每个叶子都是数和操作符（实现
被处理的数据）。树的分支就是用于产生树的这部分的规则（基于对树如何遍历和求
值的信息）。
</p>
<p>
在考虑如何做遍历之前，我们先看下定义在内部的结构体。在 <b>mpc.h</b> 找到结
构体 <b>mpc_ast_t</b> 的定义。
</p>



<pre class="example">typedef struct mpc_ast_t {
  char* tag;
  char* contents;
  mpc_state_t state;
  int children_num;
  struct mpc_ast_t** children;
} mpc_ast_t;
</pre>


<p>
<b>tag</b> - 包含了一个规则列表的字符串，如expr|number|regex。该字段可以让
我们看到哪些解析规则可用于节点。
</p>
<p>
<b>contents</b> - 包含了节点的实际内容，如'*','('或'5'。分支中这个段是空，
叶子上操作符或数字。
</p>
<p>
<b>state</b> - 包含了节点的状态信息，如行列编号。
</p>
<p>
<b>children_num</b> - 节点拥有孩子的个数。
</p>
<p>
<b>children</b> - 数组指针。
</p>



<pre class="example">/* Load AST from output */
mpc_ast_t* a = r.output;
printf("Tag: %s\n", a-&gt;tag);
printf("Contents: %s\n", a-&gt;contents);
printf("Number of children: %i\n", a-&gt;children_num);

/* Get First Child */
mpc_ast_t* c0 = a-&gt;children[0];
printf("First Child Tag: %s\n", c0-&gt;tag);
printf("First Child Contents: %s\n", c0-&gt;contents);
printf("First Child Number of children: %i\n",
  c0-&gt;children_num);
</pre>


</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 递归</h3>
<div class="outline-text-3" id="text-7-2">


<p>
这个树的结构体有点奇怪。它引用自身。树的每个孩子都是树，孩子的孩子同样
也是树。
</p>
<p>
明确的是如果我们想让一个函数工作于任何树，我们不同只能几个节点，我们必
须将其定义成为在任何深度的树都可以工作。
</p>
<p>
幸运地是我们能够做这点，通过结构体的重复性质，使用一种称为递归
(<i>recursion</i>)的技术。
</p>
<p>
递归函数作为其计算的一部分调用自身。
</p>



<pre class="example">int number_of_nodes(mpc_ast_t* t) {
  if (t-&gt;children_num == 0) { return 1; }
  if (t-&gt;children_num &gt;= 1) {
    int total = 1;
    for (int i = 0; i &lt; t-&gt;children_num; i++) {
      total = total + number_of_nodes(t-&gt;children[i]);
    }
    return total;
  }
}
</pre>


</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 求值</h3>
<div class="outline-text-3" id="text-7-3">


<p>
为了计算语法树我们将编写一个递归函数。在开始让我们看看从用户输入获取树
的结构体。
</p>


<pre class="example">lispy&gt; * 10 (+ 1 51)
&gt;
  regex
  operator|char:1:1 '*'
  expr|number|regex:1:3 '10'
  expr|&gt;
    char:1:6 '('
    operator|char:1:7 '+'
    expr|number|regex:1:9 '1'
    expr|number|regex:1:11 '51'
    char:1:13 ')'
  regex
</pre>


<p>
如果节点被标记为 <b>number</b> ，则它没有孩子，我们可以仅仅将内容转换成整型。
</p>
<p>
如果节点被标记为 <b>expr</b> ，而非 <b>number</b> ，我们需要查看它的第二个孩子
（第一个孩子通常是'('）是什么操作符。然后我们将这个操作符应用于剩余
孩子的计算，除了最后一个孩子通常是')'。
</p>
<p>
当我们对树求值，就是对节点计数，我们需要累积结果。为了表示结果我们将使
用C类型长整型 <b>long</b> 。
</p>
<p>
为了检测节点的标签或得到节点的数字，我们需要使用 <b>tag</b> 和 <b>contents</b>
字段。这个字段是字符串类型，所以我们先学习几个字符串函数：
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">atoi</td><td class="left">将 char* 转换成long</td></tr>
<tr><td class="left">strcmp</td><td class="left">比较两个 char*，如果相等返回0</td></tr>
<tr><td class="left">strstr</td><td class="left">字符串查找，返回第二个字符串在第一个字符串中的位置。如果没有找到，返回0</td></tr>
</tbody>
</table>


<p>
我们可以使用 <b>strcmp</b> 来检测使用操作符，使用 <b>strstr</b> 来检测标签包含某
个子串。我们的递归求值函数看起来如下：
</p>


<pre class="example">long eval(mpc_ast_t* t) {

  /* If tagged as number return it directly. */ 
  if (strstr(t-&gt;tag, "number")) {
    return atoi(t-&gt;contents);
  }

  /* The operator is always second child. */
  char* op = t-&gt;children[1]-&gt;contents;

  /* We store the third child in `x` */
  long x = eval(t-&gt;children[2]);

  /* Iterate the remaining children and combining. */
  int i = 3;
  while (strstr(t-&gt;children[i]-&gt;tag, "expr")) {
    x = eval_op(x, op, eval(t-&gt;children[i]));
    i++;
  }

  return x;  
}
</pre>


<p>
我们定义 <b>eval_op</b> 函数如下。
</p>


<pre class="example">/* Use operator string to see which operation to perform */
long eval_op(long x, char* op, long y) {
  if (strcmp(op, "+") == 0) { return x + y; }
  if (strcmp(op, "-") == 0) { return x - y; }
  if (strcmp(op, "*") == 0) { return x * y; }
  if (strcmp(op, "/") == 0) { return x / y; }
  return 0;
}
</pre>


</div>

</div>
