article/BuildYourOwnLisp.org
** 打印

现在我们想要打印计算结果。因此我们需要将树转递给 *eval* 函数，然后使
用 *printf* 和指定 *%li* 来打印我们得到的结果。
#+BEGIN_SRC C
long result = eval(r.output);
printf("%li\n", result);
mpc_ast_delete(r.output);
#+END_SRC

#+BEGIN_SRC SHELL
Lispy Version 0.0.0.0.3
Press Ctrl+c to Exit

lispy> + 5 6
11
lispy> - (* 10 10) (+ 1 1 1)
97
#+END_SRC

* 错误处理(Error Handling)
** 崩溃

你可以已经注意到上一章程序存在一些问题，尝试输入如下看看会发生什么。
#+BEGIN_SRC SHELL
Lispy Version 0.0.0.0.3
Press Ctrl+c to Exit

lispy> / 10 0
#+END_SRC

当试图除以0时程序崩溃。在开发之间如果程序崩溃没有关系，但我们最终程序
希望不再崩溃，应该总是向用户解释出了什么错误。

目前我们程序可以产生语法错误，但仍然不能在对表达式求值时报告错误。我们
需要构建某种错误处理。这在C中很棘手，但如果我们进入正轨，当我们系统越
来越复杂时将会得到好结果。

C程序崩溃是无法改变的。如果有什么错误，操作系统就会把它们杀掉。程序可
能有因为很多原因，以各种方式崩溃。

学会使用 *gdb* 和 *valgrind* ，可以在排错中节约大量的时间和减少痛苦。

** Lisp值

在C中存在几种方式来处理错误。在Lispy中，一个表达式的计算结果不
是 *number* 就是 *error* 。

我们定义一结构体来表示计算结果。我们将定义一个 *lval* 结构体代表Lisp值。
#+BEGIN_SRC C
/* Declare New lval Struct */
typedef struct {
  int type;
  long num;
  int err;
} lval;
#+END_SRC

*type* - 告诉我们应该访问哪个字段。
*number* - 在不出错的情况计算结果。
*err* - 出错时返回的错误编码。

** 枚举

你将注意到 *type* 和 *err* 字段都是 *int* 类型，这意味着它们需要使用使
用整型数字来表示。

我们选择 *int* 的理由是因为我们将为每个整型值赋予意义，根据我们需要进
行编码。例如，我们制定规则，如果 *type* 为0，表示结构体是一个 *Number*
，如果为1，表示结构体是一个 *Error* 。

相比直接使用0或1，我们可以使用常量，这样更容易阅读和理解代码。

在C中，使用 *enum* 来定义常量。
#+BEGIN_SRC C
enum { LVAL_NUM, LVAL_ERR };
#+END_SRC

一个 *enum* 定义了一组常量，这些常量会被系统自动赋值。

我们也可以为 /error/ 定义为枚举。
#+BEGIN_SRC C
/* Create Enumeration of Possible Error Types */
enum { LERR_DIV_ZERO, LERR_BAD_OP, LERR_BAD_NUM };
#+END_SRC

** Lisp值函数

我们定义 /error/ 类型和 /number/ 类型的 *lval* 构造函数。

#+BEGIN_SRC C
/* Create a new number type lval */
lval lval_num(long x) {
  lval v;
  v.type = LVAL_NUM;
  v.num = x;
  return v;
}

/* Create a new error type lval */
lval lval_err(int x) {
  lval v;
  v.type = LVAL_ERR;
  v.err = x;
  return v;
}

/* Print an "lval" */
void lval_print(lval v) {
  switch (v.type) {
    /* In the case the type is a number print it */
    /* Then 'break' out of the switch. */
    case LVAL_NUM: printf("%li", v.num); break;

    /* In the case the type is an error */
    case LVAL_ERR:
      /* Check what type of error it is and print it */
      if (v.err == LERR_DIV_ZERO) {
        printf("Error: Division By Zero!");
      }
      if (v.err == LERR_BAD_OP)   {
        printf("Error: Invalid Operator!");
      }
      if (v.err == LERR_BAD_NUM)  {
        printf("Error: Invalid Number!");
      }
    break;
  }
}

/* Print an "lval" followed by a newline */
void lval_println(lval v) { lval_print(v); putchar('\n'); }
#+END_SRC

** 求值错误

现在我们已经知道如何操作 *lval* 类型了，我们需要改变求值函数 *eval\_op* 。

在我们 *eval\_op* 函数中，如果我们遇到错误我们应该立即返回，仅仅只对两
个参数都是数字做计算。我们应该修改我们代码在除以0时返回错误，这样可以
解决这一章开头的崩溃问题。

#+BEGIN_SRC C
lval eval_op(lval x, char* op, lval y) {

  /* If either value is an error return it */
  if (x.type == LVAL_ERR) { return x; }
  if (y.type == LVAL_ERR) { return y; }

  /* Otherwise do maths on the number values */
  if (strcmp(op, "+") == 0) { return lval_num(x.num + y.num); }
  if (strcmp(op, "-") == 0) { return lval_num(x.num - y.num); }
  if (strcmp(op, "*") == 0) { return lval_num(x.num * y.num); }
  if (strcmp(op, "/") == 0) {
    /* If second operand is zero return error */
    return y.num == 0 
      ? lval_err(LERR_DIV_ZERO) 
      : lval_num(x.num / y.num);
  }

  return lval_err(LERR_BAD_OP);
}
#+END_SRC

我们使用 *strtol* 函数将 *string* 转换成 *long* 。它允许我们去检测特殊
变量 *errno* 来确定转换是否成功。这个方法比 *atoi* 更健壮。

#+BEGIN_SRC C
lval eval(mpc_ast_t* t) {
  
  if (strstr(t->tag, "number")) {
    /* Check if there is some error in conversion */
    errno = 0;
    long x = strtol(t->contents, NULL, 10);
    return errno != ERANGE ? lval_num(x) : lval_err(LERR_BAD_NUM);
  }
  
  char* op = t->children[1]->contents;  
  lval x = eval(t->children[2]);
  
  int i = 3;
  while (strstr(t->children[i]->tag, "expr")) {
    x = eval_op(x, op, eval(t->children[i]));
    i++;
  }
  
  return x;  
}
#+END_SRC

最后一步就是打印我们计算结果。

#+BEGIN_SRC C
lval result = eval(r.output);
lval_println(result);
mpc_ast_delete(r.output);
#+END_SRC

我们做完了，重新运行程序，确定在除以0时不会崩溃。
#+BEGIN_SRC C
lispy> / 10 0
Error: Division By Zero!
lispy> / 10 2
5
#+END_SRC

* S-表达式(S-Expressions)
** 列表与Lisp

Lisp出名的其中原因之一就是它用相同的结构表示数据和代码。它能做很多其它
语言不能做的事。如果你想要我们语言具备这种能力，我们需要将读取输入的处
理和对输入求值分离开来。

这章最后的结果与上一章只有细小的区别。这是因为我们将花时间修改内部工作
方式。这称为重构，它会让我们的生活更容易。像准备一顿饭，我们没有将食物
放在盘子里并不是意味着我们在浪费时间。

我们将创建一个内部列表结构体，用于建立数字，符号和其它列表的递归。在
Lisp中，这个结构通常称为S-Expression，我们将扩展 *lval* 结构体来表示它。
S-Expression的求值计算是Lisp的行为。为了计算S-Expression，我们看下列表
的第一项，它是一个操作符。然后我们再看下列表的剩余其它项，它们是操作数。

通过介绍S-Expression，我们将最终进入Lisp的世界。

** 指针

我们需要指定是因为函数调用的工作方式。当我们调用一个函数时，参数总是传
值。这意味着参数的副本传递给了调用的函数。大多时间它非常好，但偶尔也会
引起麻烦。

一个常见问题是当我们有一个包含了许多其它子结构的大结构体，我们希望将其
传递传递给函数。当我们每次调用函数时我们必须对结构体进行复制。仅仅调用
一个函数而复制大量的数据将会引起大量的资源消耗。

为了解决C的开发问题想出了一个聪明的主意。他们假想计算机内存是一个巨大
的字节列表。列表中的每个字节都是对应的索引或位置。有点像门牌号。第一个
字节的索引是0，第二个1，依此类推。

在这种情况下，计算机中所有的数据，包括当前程序使用的结构体和变量，在这
个巨大列表中从某个索引为起始。如果我们不是将一个函数复制数据，而是复制
数据起始索引，调用函数时就可以向其传递它想要的任意数量的数据了。

通过使用地址而不是真实数据，我们可以允许函数访问和修改内存中的一些位置
而不需要任何的数据复制。

指针只是一个数字。这个数字表示数据在内存中的起始位位置。指针的类型提示
我们和编译器，对应位置的能够访问的数据是什么类型。

我们可以通过类型和 * 后缀来声明一个指针。我们已经看到了一些实例如
mpc\_parser\_t *, mpc\_ast\_t*, 或 char*。

为了创建某数据的指针，我们需要取该数据的地址或索引。为了获取数据的地址
我们使用地址操作符 &。

最后获取某个地址上的数据，称为非关联化(/dereferencing/)，我们在变量的
左边使用*操作符。为了获取结构体指针中成员的数据，我们使用箭头 =->= 。

** 栈与堆

我说过内存就像一个长的字节列表。实际最好把它想像成两个部分。这两部分分
别为栈(/Stack/)和堆(/Heap/)。

你们某些人可能听过一些关于这个神秘位置的故事，比如“栈是向下增长，堆是
向上增长”，或“可以有许多栈，但只能有一个堆”。在C中处理栈和堆可能很
复杂，但它们不是一个迷。本质上，它们分为内存两部分用于不同的任务。

*** 栈

栈是程序居住的地方。所有你维护和编辑的临时变量和数据结构体都在这里。每
次调用函数时栈的一个新区域以备使用。这个区域放置了本地变量，参数副本以
及调用者记录和完成后做什么。当函数完成后，使用的区域被释放，以备再次被
其它程序使用。

我喜欢把栈比作建筑工地。每次我们需要做一些新事情时，我们需要为我们的工
作，材料准备足够的空间。一旦我们完成工作，我们将清理我们之前创建的空间。

*** 堆

堆用于存储对象，这些对象拥有更长的生命周期。堆必需手动申请和释放。为了
申请新内存我们使用 *malloc* 函数。这个函数接收一个字节大小作为输入，并
且返回一个指向新内存块的指针。当完成该内存块的使用后，使用 *free* 函数
将该内存块释放。

使用堆比较栈更棘手是因为它要求程序员记住正确地调用 *free* 函数。如果忘
记了调用 *free* ，越来越多的内存持续分配。这称为内存泄漏(/memory
leak/)。避免这个问题的一个简单规则就是确保每个malloc都对应一个free。

