article/BuildYourOwnLisp.org
** 解析表达式

因为我们现在思考S-Expression而非波兰表达示，所以我们需要修改我们解析器。
S-Expression的语法是简单的。这只是若干在括号的表达式，表达式可以是
Number, Operator,或其它的S-Expression。

#+BEGIN_SRC C
mpc_parser_t* Number = mpc_new("number");
mpc_parser_t* Symbol = mpc_new("symbol");
mpc_parser_t* Sexpr  = mpc_new("sexpr");
mpc_parser_t* Expr   = mpc_new("expr");
mpc_parser_t* Lispy  = mpc_new("lispy");

mpca_lang(MPCA_LANG_DEFAULT,
  "                                          \
    number : /-?[0-9]+/ ;                    \
    symbol : '+' | '-' | '*' | '/' ;         \
    sexpr  : '(' <expr>* ')' ;               \
    expr   : <number> | <symbol> | <sexpr> ; \
    lispy  : /^/ <expr>* /$/ ;               \
  ",
  Number, Symbol, Sexpr, Expr, Lispy);
#+END_SRC

我们应该记住退出之前清理这些规则。

#+BEGIN_SRC C
mpc_cleanup(5, Number, Symbol, Sexpr, Expr, Lispy);
#+END_SRC

** 表达式结构

我们需要一种存储S-Expression为 *lval* 的方式。这意味着我们需要存储
/Symbols/ 和 /Numbers/ 。我们将在 *enum* 中添加两个新成员。 *LVAL\_SYM*
用于表示操作符，如+。 *LVAL\_SEXPR* 用于表示S-Expression。

#+BEGIN_SRC C
enum { LVAL_ERR, LVAL_NUM, LVAL_SYM, LVAL_SEXPR };
#+END_SRC

S_Expression是一个可变长列表。我们将创建一个指针成员，指向 *lval** 列
表。

#+BEGIN_SRC C
typedef struct lval {
  int type;
  long num;
  /* Error and Symbol types have some string data */
  char* err;
  char* sym;
  /* Count and Pointer to a list of "lval*" */
  int count;
  struct lval** cell;
} lval;
#+END_SRC

** 构造与析构

我们可以修改我们的 *lval* 构造函数使其返回指向 *lval* 的指针。

#+BEGIN_SRC C
/* Construct a pointer to a new Number lval */ 
lval* lval_num(long x) {
  lval* v = malloc(sizeof(lval));
  v->type = LVAL_NUM;
  v->num = x;
  return v;
}


/* Construct a pointer to a new Error lval */ 
lval* lval_err(char* m) {
  lval* v = malloc(sizeof(lval));
  v->type = LVAL_ERR;
  v->err = malloc(strlen(m) + 1);
  strcpy(v->err, m);
  return v;
}


/* Construct a pointer to a new Symbol lval */ 
lval* lval_sym(char* s) {
  lval* v = malloc(sizeof(lval));
  v->type = LVAL_SYM;
  v->sym = malloc(strlen(s) + 1);
  strcpy(v->sym, s);
  return v;
}


/* A pointer to a new empty Sexpr lval */
lval* lval_sexpr(void) {
  lval* v = malloc(sizeof(lval));
  v->type = LVAL_SEXPR;
  v->count = 0;
  v->cell = NULL;
  return v;
}

#+END_SRC

我们需在需要一个特殊函数用来删除 *lval** 。它应该调用 *free* 来释
放从 *malloc* 获取到的内存。更重要地是我们应该检测 *lval* ，释放任何由
其指针字段指向的内存，确保不会内存泄漏。  

#+BEGIN_SRC C
void lval_del(lval* v) {

  switch (v->type) {
    /* Do nothing special for number type */
    case LVAL_NUM: break;

    /* For Err or Sym free the string data */
    case LVAL_ERR: free(v->err); break;
    case LVAL_SYM: free(v->sym); break;

    /* If Sexpr then delete all elements inside */
    case LVAL_SEXPR:
      for (int i = 0; i < v->count; i++) {
        lval_del(v->cell[i]);
      }
      /* Also free the memory allocated to contain the pointers */
      free(v->cell);
    break;
  }

  /* Free the memory allocated for the "lval" struct itself */
  free(v);
}
#+END_SRC

** 读取表达式

首先我们在程序读取用户输入并构建 *lval** 来表示它。然后我们对 *lval**
求值并获取结果。第一步将抽象语法树转换成S-Expression，第二步使用我们
Lisp规则来对S-Expression求值。

为了完成第一步，我们需要递归遍历树中的每个节点，根据 节点的 *tag*
和 *contents* 字段构建不同 *lval** 类型。

如果所给的节点的标签是 *number* 或 *symbol* ，我们使用我们的构造函数并
直接返回 *lval** 。 如果所给的节点是 *root* 或 *sexpr* 。我们创建一个
空的S-Expression *lval* ，然后将树中每一个有效的子表达式添加其中。

为了向一个S-Expression添加一个元素，我们创建一个 *lval\_add* 函数。这个
函数给表达式列表的数量加1。我们使用 *realloc* 函数重新分配 *v->cell* 所
需要的空间。新空间用于存储额外的 *lval** 。

#+BEGIN_SRC C
lval* lval_read_num(mpc_ast_t* t) {
  errno = 0;
  long x = strtol(t->contents, NULL, 10);
  return errno != ERANGE ?
    lval_num(x) : lval_err("invalid number");
}

lval* lval_read(mpc_ast_t* t) {

  /* If Symbol or Number return conversion to that type */
  if (strstr(t->tag, "number")) { return lval_read_num(t); }
  if (strstr(t->tag, "symbol")) { return lval_sym(t->contents); }

  /* If root (>) or sexpr then create empty list */
  lval* x = NULL;
  if (strcmp(t->tag, ">") == 0) { x = lval_sexpr(); } 
  if (strstr(t->tag, "sexpr"))  { x = lval_sexpr(); }

  /* Fill this list with any valid expression contained within */
  for (int i = 0; i < t->children_num; i++) {
    if (strcmp(t->children[i]->contents, "(") == 0) { continue; }
    if (strcmp(t->children[i]->contents, ")") == 0) { continue; }
    if (strcmp(t->children[i]->contents, "}") == 0) { continue; }
    if (strcmp(t->children[i]->contents, "{") == 0) { continue; }
    if (strcmp(t->children[i]->tag,  "regex") == 0) { continue; }
    x = lval_add(x, lval_read(t->children[i]));
  }

  return x;
}

lval* lval_add(lval* v, lval* x) {
  v->count++;
  v->cell = realloc(v->cell, sizeof(lval*) * v->count);
  v->cell[v->count-1] = x;
  return v;
}
#+END_SRC

** 打印表达式

我们需要修改我们打印函数，以便能打印S-Expression。

#+BEGIN_SRC C
void lval_expr_print(lval* v, char open, char close) {
  putchar(open);
  for (int i = 0; i < v->count; i++) {

    /* Print Value contained within */
    lval_print(v->cell[i]);

    /* Don't print trailing space if last element */
    if (i != (v->count-1)) {
      putchar(' ');
    }
  }
  putchar(close);
}


void lval_print(lval* v) {
  switch (v->type) {
    case LVAL_NUM:   printf("%li", v->num); break;
    case LVAL_ERR:   printf("Error: %s", v->err); break;
    case LVAL_SYM:   printf("%s", v->sym); break;
    case LVAL_SEXPR: lval_expr_print(v, '(', ')'); break;
  }
}

void lval_println(lval* v) { lval_print(v); putchar('\n'); }
#+END_SRC

在我们主循环中，我们可以打印结果，最后将 *lval** 结构移除。
#+BEGIN_SRC C
lval* x = lval_read(r.output);
lval_println(x);
lval_del(x);
#+END_SRC

如果成功，运行程序，你可以看到如下所示。
#+BEGIN_SRC C
lispy> + 2 2
(+ 2 2)
lispy> + 2 (* 7 6) (* 2 5)
(+ 2 (* 7 6) (* 2 5))
lispy> *     55     101  (+ 0 0 0)
(* 55 101 (+ 0 0 0))
lispy>
#+END_SRC

