article/BuildYourOwnLisp.html

<div id="outline-container-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> 解析表达式</h3>
<div class="outline-text-3" id="text-9-4">


<p>
因为我们现在思考S-Expression而非波兰表达示，所以我们需要修改我们解析器。
S-Expression的语法是简单的。这只是若干在括号的表达式，表达式可以是
Number, Operator,或其它的S-Expression。
</p>



<pre class="example">mpc_parser_t* Number = mpc_new("number");
mpc_parser_t* Symbol = mpc_new("symbol");
mpc_parser_t* Sexpr  = mpc_new("sexpr");
mpc_parser_t* Expr   = mpc_new("expr");
mpc_parser_t* Lispy  = mpc_new("lispy");

mpca_lang(MPCA_LANG_DEFAULT,
  "                                          \
    number : /-?[0-9]+/ ;                    \
    symbol : '+' | '-' | '*' | '/' ;         \
    sexpr  : '(' &lt;expr&gt;* ')' ;               \
    expr   : &lt;number&gt; | &lt;symbol&gt; | &lt;sexpr&gt; ; \
    lispy  : /^/ &lt;expr&gt;* /$/ ;               \
  ",
  Number, Symbol, Sexpr, Expr, Lispy);
</pre>


<p>
我们应该记住退出之前清理这些规则。
</p>



<pre class="example">mpc_cleanup(5, Number, Symbol, Sexpr, Expr, Lispy);
</pre>


</div>

</div>

<div id="outline-container-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> 表达式结构</h3>
<div class="outline-text-3" id="text-9-5">


<p>
我们需要一种存储S-Expression为 <b>lval</b> 的方式。这意味着我们需要存储
<i>Symbols</i> 和 <i>Numbers</i> 。我们将在 <b>enum</b> 中添加两个新成员。 <b>LVAL_SYM</b>
用于表示操作符，如+。 <b>LVAL_SEXPR</b> 用于表示S-Expression。
</p>



<pre class="example">enum { LVAL_ERR, LVAL_NUM, LVAL_SYM, LVAL_SEXPR };
</pre>


<p>
S<sub>Expression是一个可变长列表。我们将创建一个指针成员，指向</sub> <b>lval*</b> 列
表。
</p>



<pre class="example">typedef struct lval {
  int type;
  long num;
  /* Error and Symbol types have some string data */
  char* err;
  char* sym;
  /* Count and Pointer to a list of "lval*" */
  int count;
  struct lval** cell;
} lval;
</pre>


</div>

</div>

<div id="outline-container-9-6" class="outline-3">
<h3 id="sec-9-6"><span class="section-number-3">9.6</span> 构造与析构</h3>
<div class="outline-text-3" id="text-9-6">


<p>
我们可以修改我们的 <b>lval</b> 构造函数使其返回指向 <b>lval</b> 的指针。
</p>



<pre class="example">/* Construct a pointer to a new Number lval */ 
lval* lval_num(long x) {
  lval* v = malloc(sizeof(lval));
  v-&gt;type = LVAL_NUM;
  v-&gt;num = x;
  return v;
}


/* Construct a pointer to a new Error lval */ 
lval* lval_err(char* m) {
  lval* v = malloc(sizeof(lval));
  v-&gt;type = LVAL_ERR;
  v-&gt;err = malloc(strlen(m) + 1);
  strcpy(v-&gt;err, m);
  return v;
}


/* Construct a pointer to a new Symbol lval */ 
lval* lval_sym(char* s) {
  lval* v = malloc(sizeof(lval));
  v-&gt;type = LVAL_SYM;
  v-&gt;sym = malloc(strlen(s) + 1);
  strcpy(v-&gt;sym, s);
  return v;
}


/* A pointer to a new empty Sexpr lval */
lval* lval_sexpr(void) {
  lval* v = malloc(sizeof(lval));
  v-&gt;type = LVAL_SEXPR;
  v-&gt;count = 0;
  v-&gt;cell = NULL;
  return v;
}

</pre>


<p>
我们需在需要一个特殊函数用来删除 <b>lval*</b> 。它应该调用 <b>free</b> 来释
放从 <b>malloc</b> 获取到的内存。更重要地是我们应该检测 <b>lval</b> ，释放任何由
其指针字段指向的内存，确保不会内存泄漏。  
</p>



<pre class="example">void lval_del(lval* v) {

  switch (v-&gt;type) {
    /* Do nothing special for number type */
    case LVAL_NUM: break;

    /* For Err or Sym free the string data */
    case LVAL_ERR: free(v-&gt;err); break;
    case LVAL_SYM: free(v-&gt;sym); break;

    /* If Sexpr then delete all elements inside */
    case LVAL_SEXPR:
      for (int i = 0; i &lt; v-&gt;count; i++) {
        lval_del(v-&gt;cell[i]);
      }
      /* Also free the memory allocated to contain the pointers */
      free(v-&gt;cell);
    break;
  }

  /* Free the memory allocated for the "lval" struct itself */
  free(v);
}
</pre>


</div>

</div>

<div id="outline-container-9-7" class="outline-3">
<h3 id="sec-9-7"><span class="section-number-3">9.7</span> 读取表达式</h3>
<div class="outline-text-3" id="text-9-7">


<p>
首先我们在程序读取用户输入并构建 <b>lval*</b> 来表示它。然后我们对 <b>lval*</b>
求值并获取结果。第一步将抽象语法树转换成S-Expression，第二步使用我们
Lisp规则来对S-Expression求值。
</p>
<p>
为了完成第一步，我们需要递归遍历树中的每个节点，根据 节点的 <b>tag</b>
和 <b>contents</b> 字段构建不同 <b>lval*</b> 类型。
</p>
<p>
如果所给的节点的标签是 <b>number</b> 或 <b>symbol</b> ，我们使用我们的构造函数并
直接返回 <b>lval*</b> 。 如果所给的节点是 <b>root</b> 或 <b>sexpr</b> 。我们创建一个
空的S-Expression <b>lval</b> ，然后将树中每一个有效的子表达式添加其中。
</p>
<p>
为了向一个S-Expression添加一个元素，我们创建一个 <b>lval_add</b> 函数。这个
函数给表达式列表的数量加1。我们使用 <b>realloc</b> 函数重新分配 <b>v-&gt;cell</b> 所
需要的空间。新空间用于存储额外的 <b>lval*</b> 。
</p>



<pre class="example">lval* lval_read_num(mpc_ast_t* t) {
  errno = 0;
  long x = strtol(t-&gt;contents, NULL, 10);
  return errno != ERANGE ?
    lval_num(x) : lval_err("invalid number");
}

lval* lval_read(mpc_ast_t* t) {

  /* If Symbol or Number return conversion to that type */
  if (strstr(t-&gt;tag, "number")) { return lval_read_num(t); }
  if (strstr(t-&gt;tag, "symbol")) { return lval_sym(t-&gt;contents); }

  /* If root (&gt;) or sexpr then create empty list */
  lval* x = NULL;
  if (strcmp(t-&gt;tag, "&gt;") == 0) { x = lval_sexpr(); } 
  if (strstr(t-&gt;tag, "sexpr"))  { x = lval_sexpr(); }

  /* Fill this list with any valid expression contained within */
  for (int i = 0; i &lt; t-&gt;children_num; i++) {
    if (strcmp(t-&gt;children[i]-&gt;contents, "(") == 0) { continue; }
    if (strcmp(t-&gt;children[i]-&gt;contents, ")") == 0) { continue; }
    if (strcmp(t-&gt;children[i]-&gt;contents, "}") == 0) { continue; }
    if (strcmp(t-&gt;children[i]-&gt;contents, "{") == 0) { continue; }
    if (strcmp(t-&gt;children[i]-&gt;tag,  "regex") == 0) { continue; }
    x = lval_add(x, lval_read(t-&gt;children[i]));
  }

  return x;
}

lval* lval_add(lval* v, lval* x) {
  v-&gt;count++;
  v-&gt;cell = realloc(v-&gt;cell, sizeof(lval*) * v-&gt;count);
  v-&gt;cell[v-&gt;count-1] = x;
  return v;
}
</pre>


</div>

</div>

<div id="outline-container-9-8" class="outline-3">
<h3 id="sec-9-8"><span class="section-number-3">9.8</span> 打印表达式</h3>
<div class="outline-text-3" id="text-9-8">


<p>
我们需要修改我们打印函数，以便能打印S-Expression。
</p>



<pre class="example">void lval_expr_print(lval* v, char open, char close) {
  putchar(open);
  for (int i = 0; i &lt; v-&gt;count; i++) {

    /* Print Value contained within */
    lval_print(v-&gt;cell[i]);

    /* Don't print trailing space if last element */
    if (i != (v-&gt;count-1)) {
      putchar(' ');
    }
  }
  putchar(close);
}


void lval_print(lval* v) {
  switch (v-&gt;type) {
    case LVAL_NUM:   printf("%li", v-&gt;num); break;
    case LVAL_ERR:   printf("Error: %s", v-&gt;err); break;
    case LVAL_SYM:   printf("%s", v-&gt;sym); break;
    case LVAL_SEXPR: lval_expr_print(v, '(', ')'); break;
  }
}

void lval_println(lval* v) { lval_print(v); putchar('\n'); }
</pre>


<p>
在我们主循环中，我们可以打印结果，最后将 <b>lval*</b> 结构移除。
</p>


<pre class="example">lval* x = lval_read(r.output);
lval_println(x);
lval_del(x);
</pre>


<p>
如果成功，运行程序，你可以看到如下所示。
</p>


<pre class="example">lispy&gt; + 2 2
(+ 2 2)
lispy&gt; + 2 (* 7 6) (* 2 5)
(+ 2 (* 7 6) (* 2 5))
lispy&gt; *     55     101  (+ 0 0 0)
(* 55 101 (+ 0 0 0))
lispy&gt;
</pre>


</div>

</div>
