article/BuildYourOwnLisp.org
** 计算表达式

我们的求值函数在很大程度上与以前相同。我们需要将其修改能够处理 *lval**
和构成表达式的结构体。我们可以将我们的求值函数想象成一个转换器。它将某
个 *lval** 转换成另一个新的 *lval** 。如果我们返回一个新的 *lval** ，
我们必须总是记得删除作为输入的 *lval** 。

首先我们计算S-Expression的所有孩子。如果任何一个孩子出错，我们将使
用 *lval_take* 返回我们遇到的第一个错误。

如果S-Expression没有孩子，我们只需直接返回。对于空表达式，用 *()* 表示。
我们也要检查单个表达式。这些表达式仅有一个孩子，如 *(5)* 。这种情况下
我们在括号的表达式。

#+BEGIN_SRC C
lval* lval_eval_sexpr(lval* v) {

  /* Evaluate Children */
  for (int i = 0; i < v->count; i++) {
    v->cell[i] = lval_eval(v->cell[i]);
  }

  /* Error Checking */
  for (int i = 0; i < v->count; i++) {
    if (v->cell[i]->type == LVAL_ERR) { return lval_take(v, i); }
  }

  /* Empty Expression */
  if (v->count == 0) { return v; }

  /* Single Expression */
  if (v->count == 1) { return lval_take(v, 0); }

  /* Ensure First Element is Symbol */
  lval* f = lval_pop(v, 0);
  if (f->type != LVAL_SYM) {
    lval_del(f); lval_del(v);
    return lval_err("S-expression Does not start with symbol!");
  }

  /* Call builtin with operator */
  lval* result = builtin_op(v, f->sym);
  lval_del(f);
  return result;
}

lval* lval_eval(lval* v) {
  /* Evaluate Sexpressions */
  if (v->type == LVAL_SEXPR) { return lval_eval_sexpr(v); }
  /* All other lval types remain the same */
  return v;
}

lval* lval_pop(lval* v, int i) {
  /* Find the item at "i" */
  lval* x = v->cell[i];

  /* Shift memory after the item at "i" over the top */
  memmove(&v->cell[i], &v->cell[i+1],
    sizeof(lval*) * (v->count-i-1));

  /* Decrease the count of items in the list */
  v->count--;

  /* Reallocate the memory used */
  v->cell = realloc(v->cell, sizeof(lval*) * v->count);
  return x;
}

lval* lval_take(lval* v, int i) {
  lval* x = lval_pop(v, i);
  lval_del(v);
  return x;
}
#+END_SRC

*lval\_pop* 函数从S-Expression中提取索引为i的单个元素，向回移动剩余的
列表元素，这样列表中就不再包含那个被提取的元素。然后它返回提取的值。记
住它并没有删除输入列表。它就像把元素从列表中弹出，留下剩余的元素。

*lval\_take* 函数与 *lval\_pop* 类似，只不过删除了列表。这就像把元素从
列表中取出然后删除其余的元素。

我们也需要定义一个求值函数 *builtin\_op* 。

#+BEGIN_SRC C
lval* builtin_op(lval* a, char* op) {
  
  /* Ensure all arguments are numbers */
  for (int i = 0; i < a->count; i++) {
    if (a->cell[i]->type != LVAL_NUM) {
      lval_del(a);
      return lval_err("Cannot operate on non-number!");
    }
  }
  
  /* Pop the first element */
  lval* x = lval_pop(a, 0);

  /* If no arguments and sub then perform unary negation */
  if ((strcmp(op, "-") == 0) && a->count == 0) {
    x->num = -x->num;
  }

  /* While there are still elements remaining */
  while (a->count > 0) {

    /* Pop the next element */
    lval* y = lval_pop(a, 0);

    if (strcmp(op, "+") == 0) { x->num += y->num; }
    if (strcmp(op, "-") == 0) { x->num -= y->num; }
    if (strcmp(op, "*") == 0) { x->num *= y->num; }
    if (strcmp(op, "/") == 0) {
      if (y->num == 0) {
        lval_del(x); lval_del(y);
        x = lval_err("Division By Zero!"); break;
      }
      x->num /= y->num;
    }

    lval_del(y);
  }

  lval_del(a); return x;
}
#+END_SRC

完成求值函数后，我们只需要修改 *main* 函数。
#+BEGIN_SRC C
lval* x = lval_eval(lval_read(r.output));
lval_println(x);
lval_del(x);
#+END_SRC

现在你应该能够像上一章一样正确地对表达式求值了。

#+BEGIN_SRC shell
lispy> + 1 (* 7 5) 3
39
lispy> (- 100)
-100
lispy>
()
lispy> /
/
lispy> (/ ())
Error: Cannot operate on non-number!
lispy>
#+END_SRC

* Q-表达式(Q-Expressions)
* 变量(Variables)
* 函数(Functions)
* 条件(Conditionals)
* 字符串(Strings)
* 标准库(Standard Library)
* 奖励项目(Bonus Projects)

* Q-表达式(Q-Expressions)
* 变量(Variables)
* 函数(Functions)
* 条件(Conditionals)
* 字符串(Strings)
* 标准库(Standard Library)
* 奖励项目(Bonus Projects)
 
