article/BuildYourOwnLisp.html

<div id="outline-container-9-9" class="outline-3">
<h3 id="sec-9-9"><span class="section-number-3">9.9</span> 计算表达式</h3>
<div class="outline-text-3" id="text-9-9">


<p>
我们的求值函数在很大程度上与以前相同。我们需要将其修改能够处理 <b>lval*</b>
和构成表达式的结构体。我们可以将我们的求值函数想象成一个转换器。它将某
个 <b>lval*</b> 转换成另一个新的 <b>lval*</b> 。如果我们返回一个新的 <b>lval*</b> ，
我们必须总是记得删除作为输入的 <b>lval*</b> 。
</p>
<p>
首先我们计算S-Expression的所有孩子。如果任何一个孩子出错，我们将使
用 <b>lval<sub>take</sub></b> 返回我们遇到的第一个错误。
</p>
<p>
如果S-Expression没有孩子，我们只需直接返回。对于空表达式，用 <b>()</b> 表示。
我们也要检查单个表达式。这些表达式仅有一个孩子，如 <b>(5)</b> 。这种情况下
我们在括号的表达式。
</p>



<pre class="example">lval* lval_eval_sexpr(lval* v) {

  /* Evaluate Children */
  for (int i = 0; i &lt; v-&gt;count; i++) {
    v-&gt;cell[i] = lval_eval(v-&gt;cell[i]);
  }

  /* Error Checking */
  for (int i = 0; i &lt; v-&gt;count; i++) {
    if (v-&gt;cell[i]-&gt;type == LVAL_ERR) { return lval_take(v, i); }
  }

  /* Empty Expression */
  if (v-&gt;count == 0) { return v; }

  /* Single Expression */
  if (v-&gt;count == 1) { return lval_take(v, 0); }

  /* Ensure First Element is Symbol */
  lval* f = lval_pop(v, 0);
  if (f-&gt;type != LVAL_SYM) {
    lval_del(f); lval_del(v);
    return lval_err("S-expression Does not start with symbol!");
  }

  /* Call builtin with operator */
  lval* result = builtin_op(v, f-&gt;sym);
  lval_del(f);
  return result;
}

lval* lval_eval(lval* v) {
  /* Evaluate Sexpressions */
  if (v-&gt;type == LVAL_SEXPR) { return lval_eval_sexpr(v); }
  /* All other lval types remain the same */
  return v;
}

lval* lval_pop(lval* v, int i) {
  /* Find the item at "i" */
  lval* x = v-&gt;cell[i];

  /* Shift memory after the item at "i" over the top */
  memmove(&amp;v-&gt;cell[i], &amp;v-&gt;cell[i+1],
    sizeof(lval*) * (v-&gt;count-i-1));

  /* Decrease the count of items in the list */
  v-&gt;count--;

  /* Reallocate the memory used */
  v-&gt;cell = realloc(v-&gt;cell, sizeof(lval*) * v-&gt;count);
  return x;
}

lval* lval_take(lval* v, int i) {
  lval* x = lval_pop(v, i);
  lval_del(v);
  return x;
}
</pre>


<p>
<b>lval_pop</b> 函数从S-Expression中提取索引为i的单个元素，向回移动剩余的
列表元素，这样列表中就不再包含那个被提取的元素。然后它返回提取的值。记
住它并没有删除输入列表。它就像把元素从列表中弹出，留下剩余的元素。
</p>
<p>
<b>lval_take</b> 函数与 <b>lval_pop</b> 类似，只不过删除了列表。这就像把元素从
列表中取出然后删除其余的元素。
</p>
<p>
我们也需要定义一个求值函数 <b>builtin_op</b> 。
</p>



<pre class="example">lval* builtin_op(lval* a, char* op) {

  /* Ensure all arguments are numbers */
  for (int i = 0; i &lt; a-&gt;count; i++) {
    if (a-&gt;cell[i]-&gt;type != LVAL_NUM) {
      lval_del(a);
      return lval_err("Cannot operate on non-number!");
    }
  }

  /* Pop the first element */
  lval* x = lval_pop(a, 0);

  /* If no arguments and sub then perform unary negation */
  if ((strcmp(op, "-") == 0) &amp;&amp; a-&gt;count == 0) {
    x-&gt;num = -x-&gt;num;
  }

  /* While there are still elements remaining */
  while (a-&gt;count &gt; 0) {

    /* Pop the next element */
    lval* y = lval_pop(a, 0);

    if (strcmp(op, "+") == 0) { x-&gt;num += y-&gt;num; }
    if (strcmp(op, "-") == 0) { x-&gt;num -= y-&gt;num; }
    if (strcmp(op, "*") == 0) { x-&gt;num *= y-&gt;num; }
    if (strcmp(op, "/") == 0) {
      if (y-&gt;num == 0) {
        lval_del(x); lval_del(y);
        x = lval_err("Division By Zero!"); break;
      }
      x-&gt;num /= y-&gt;num;
    }

    lval_del(y);
  }

  lval_del(a); return x;
}
</pre>


<p>
完成求值函数后，我们只需要修改 <b>main</b> 函数。
</p>


<pre class="example">lval* x = lval_eval(lval_read(r.output));
lval_println(x);
lval_del(x);
</pre>


<p>
现在你应该能够像上一章一样正确地对表达式求值了。
</p>



<pre class="example">LISPY&gt; + 1 (* 7 5) 3
39
LISPY&gt; (- 100)
-100
LISPY&gt;
()
LISPY&gt; /
/
LISPY&gt; (/ ())
Error: Cannot operate on non-number!
LISPY&gt;
</pre>


</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Q-表达式(Q-Expressions)</h2>
<div class="outline-text-2" id="text-10">

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 变量(Variables)</h2>
<div class="outline-text-2" id="text-11">

</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 函数(Functions)</h2>
<div class="outline-text-2" id="text-12">

</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> 条件(Conditionals)</h2>
<div class="outline-text-2" id="text-13">

</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> 字符串(Strings)</h2>
<div class="outline-text-2" id="text-14">

</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> 标准库(Standard Library)</h2>
<div class="outline-text-2" id="text-15">

</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> 奖励项目(Bonus Projects)</h2>
<div class="outline-text-2" id="text-16">

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-01-14T13:42+0800</p>
<p class="author">Author: </p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
